bot_name = 'FactoryMoscowZooBot'

advertising_text = '🐧Кстати, у нашего зоопарка есть возможность подружить вас.\n\n\
Жми кнопку "Подружиться" и команда Московского зоопарка всё тебе расскажет.'

quiz_questions = [
    {
        "question": "1/15. 🏃‍♂️ Какой стиль жизни Вам ближе?",
        "answers": [
            "A) Активный и свободолюбивый",
            "B) Спокойный и размеренный",
            "C) Нестандартный и неожиданный",
            "D) Социальный и командный"
        ]
    },
    {
        "question": "2/15. ❤️ Что для Вас важнее всего?",
        "answers": [
            "A) Личная свобода",
            "B) Забота о близких",
            "C) Успех и достижения",
            "D) Понимание себя и мира"
        ]
    },
    {
        "question": "3/15. 🌿 Как Вы воспринимаете природу?",
        "answers": [
            "A) Как источник силы и вдохновения",
            "B) Как место уединения и покоя",
            "C) Как среду для исследования и открытий",
            "D) Как часть культурного наследия"
        ]
    },
    {
        "question": "4/15. ⚔️ Как Вы реагируете на конфликты?",
        "answers": [
            "A) Прямо и решительно",
            "B) Избегаете или стараетесь смягчить",
            "C) Используете хитрость и тактику",
            "D) Стараетесь найти общее решение"
        ]
    },
    {
        "question": "5/15. 🌩️ Какой у Вас темперамент?",
        "answers": [
            "A) Эмоциональный и страстный",
            "B) Рассудительный и осторожный",
            "C) Неугомонный и любознательный",
            "D) Хладнокровный и расчётливый"
        ]
    },
    {
        "question": "6/15. 🎲 Как Вы относитесь к рискам?",
        "answers": [
            "A) Любите рисковать, если верите в успех",
            "B) Предпочитаете избегать",
            "C) Взвешиваете шансы, но готовы рискнуть",
            "D) Иногда берёте на себя смелые решения"
        ]
    },
    {
        "question": "7/15. 💬 Какой стиль общения Вам ближе?",
        "answers": [
            "A) Яркий, харизматичный",
            "B) Сдержанный и доверительный",
            "C) Остроумный и игривый",
            "D) Мудрый и проницательный"
        ]
    },
    {
        "question": "8/15. 🌟 Что Вас мотивирует?",
        "answers": [
            "A) Достижение целей и признания",
            "B) Спокойствие и гармония",
            "C) Открытие нового и интересного",
            "D) Поддержка других и чувство долга"
        ]
    },
    {
        "question": "9/15. 🏖️ Как Вы проводите свободное время?",
        "answers": [
            "A) На приключениях или активном отдыхе",
            "B) В одиночестве или с близкими",
            "C) За чем-то необычным или творческим",
            "D) В компании друзей"
        ]
    },
    {
        "question": "10/15. ☁️ Какая погода Вам нравится больше?",
        "answers": [
            "A) Штормовая или дождливая",
            "B) Тихая и солнечная",
            "C) Непредсказуемая и переменчивая",
            "D) Холодная, но ясная"
        ]
    },
    {
        "question": "11/15. 🤔 Какой у Вас подход к проблемам?",
        "answers": [
            "A) Прямой и решительный",
            "B) Медленный, но уверенный",
            "C) Нестандартный и гибкий",
            "D) Анализирующий и вдумчивый"
        ]
    },
    {
        "question": "12/15. 🧭 Как Вы обычно действуете?",
        "answers": [
            "A) Первым берёте инициативу",
            "B) Следуете за другими",
            "C) Самостоятельно, своим путём",
            "D) По ситуации, зависит от обстоятельств"
        ]
    },
    {
        "question": "13/15. 🎨 Какой цвет вам нравится?",
        "answers": [
            "A) Чёрный или красный",
            "B) Коричневый или зелёный",
            "C) Серо-голубой или фиолетовый",
            "D) Белый или жёлтый"
        ]
    },
    {
        "question": "14/15. 👀 Как Вы воспринимаете окружающих?",
        "answers": [
            "A) С интересом, но настороженно",
            "B) Дружелюбно и с пониманием",
            "C) С весельем и игривостью",
            "D) С недоверием, пока не узнаете ближе"
        ]
    },
    {
        "question": "15/15. 🤝 Что Вы цените в людях?",
        "answers": [
            "A) Силу и уверенность",
            "B) Верность и честность",
            "C) Смекалку и эрудицию",
            "D) Мудрость и терпение"
        ]
    }
]

animals_dict = {
    'Ирбис' : {
        'image_url' : 'https://storage.moscowzoo.ru\
/storage/647edc2a70bb5462366280fc/images/animals/a0e4623d-cc2e-4e6b-a812-c453e2f35591.jpeg',
        'discription' :  'Элегантный и загадочный, живущий на своём уровне, вне обыденности',
        'url' : 'https://moscowzoo.ru/animals/kinds/irbis_snezhnyy_bars'
    },
    'Ленивец' : {
        'image_url' : 'https://storage.moscowzoo.ru/storage\
/647edc2a70bb5462366280fc/images/animalsdetail/e6fda1e3-4588-4098-90d4-cd2601aac485.jpeg',
        'discription' : 'Покойный, неторопливый, но глубоко мыслящий',
        'url' : 'https://moscowzoo.ru/animals/kinds/dvupalyy_lenivec'
    },
    'Японский макак' : {
        'image_url' : 'https://storage.moscowzoo.ru\
/storage/647edc2a70bb5462366280fc/images/animals/c7c07187-2857-46e2-9ba5-8ae94860c8c4.JPG',
        'discription' : 'Общительный, эмоциональный и легко адаптирующийся к любым условиям',
        'url': 'https://moscowzoo.ru/animals/kinds/yaponskiy_makak'
    },
    'Лемур' : {
        'image_url' : 'https://storage.moscowzoo.ru/storage\
/647edc2a70bb5462366280fc/images/animals/79da8af4-7f66-45fc-b526-2d2395ebc9a8.jpeg',
        'discription' : 'Чувственный, грациозный и ориентированный на связи с окружающими',
        'url': 'https://moscowzoo.ru/animals/kinds/lemur_koshachiy'
    },
    'Папуанский пингвин' : {
        'image_url' : 'https://storage.moscowzoo.ru\
/storage/647edc2a70bb5462366280fc/images/animals/2cd872b5-7f55-481e-a7d1-159c4d5f0ca2.jpeg',
        'discription' : 'Стойкий, выносливый, умеющий сохранять равновесие даже в сложных условиях',
        'url': 'https://moscowzoo.ru/animals/kinds/papuanskiy_pingvin'
    },
    'Медоед' : {
        'image_url' : 'https://storage.moscowzoo.ru/storage\
/647edc2a70bb5462366280fc/images/animals/16cb2d06-ecce-4e44-a01c-f6d7ba40be5f.jpeg',
        'discription' : 'Неунывающий боец, способный справиться почти с чем угодно',
        'url': 'https://moscowzoo.ru/animals/kinds/medoed'
    },
    'Амурский тигр' : {
        'image_url' : 'https://storage.moscowzoo.ru/storage/647edc2a70bb5462366280fc\
/images/animals/71062cdc-ae27-432a-84ed-d3743afd903b.jpeg',
        'discription' : 'Сильный, мощный лидер, с высокой самооценкой и \
внутренней энергией',
        'url': 'https://moscowzoo.ru/animals/kinds/amurskiy_tigr'
    },
    'Капибара' : {
        'image_url' : 'https://storage.moscowzoo.ru/storage\
/647edc2a70bb5462366280fc/images/animals/df1e1de9-6e0f-49aa-a019-14d9d320e0c4.jpg',
        'discription' : 'Умиротворяющая личность, умеющая находить общий \
язык со всеми и сохранять спокойствие',
        'url': 'https://moscowzoo.ru/animals/kinds/kapibara'
    },
    'Енот полоскун' : {
        'image_url' : 'https://storage.moscowzoo.ru/storage\
/647edc2a70bb5462366280fc/images/animals/4442cefb-7195-445e-9070-f92a3f8baf63.jpg',
        'discription' : 'Любознательный, изобретательный, немного хитроватый и \
всегда умеющий найти выход',
        'url': 'https://moscowzoo.ru/animals/kinds/enot_poloskun'
    },
    'Филин' : {
        'image_url' : 'https://storage.moscowzoo.ru/storage\
/647edc2a70bb5462366280fc/images/animals/763a0d3c-a7da-4cf1-812e-f0677e3df808.jpeg',
        'discription' : 'Мудрый наблюдатель, любящий знания, интуицию и тишину',
        'url': 'https://moscowzoo.ru/animals/kinds/filin'
    },
    'Степной сурок' : {
        'image_url' : 'https://storage.moscowzoo.ru/storage\
/647edc2a70bb5462366280fc/images/animals/760cb520-4493-4005-bd0a-523a41b2224d.jpg',
        'discription' : 'Практичный, организованный и заботящийся о безопасности',
        'url': 'https://moscowzoo.ru/animals/kinds/stepnoy_surok'
    }
}

